#include <stdio.h>
int main ()
{
	printf("请输入一个非负整数。\n");
	int x;
	int t=0;
	scanf("%d",&x);
	//演示草稿如下： 
	//x=13425;
	//  13425/10000 = 1
	//  13425%10000 = 3425
	//  10000/10    =1000
	//  3425/1000   =3
	//  3425%1000   =425
	//  1000/10     =100
	//  425/100     =4
	//  425%100     =25
	//  100/10      =10
	//  25/10       =2
	//  25%10       =5
	//  10/10       =1
	//  5/1         =5
	//  5%1         =5
	//  1/10        =0 
	do {
		int d=x%10;
		t=t*10+d;
		x/=10;
	} while (x>0);
	printf("x=%d,t=%d\n",x,t);
	x=t;
	do {
		int d=x%10;
		printf("%d",d);
		if (x>9) {
			printf(" ");
		}
		x/=10;
	} while (x>0);
	printf("\n");
	return 0;
}
